bjs0306b/fast-autonomous-forklift/firmware/esp32/motor_controller/sdkconfig.defaults
# Geekble nano ESP32-S3 (Arduino Nano ESP32 footprint)
CONFIG_IDF_TARGET="esp32s3"

# The board exposes only the native USB connector, so the console must live on
# USB Serial/JTAG; UART0 (GPIO43/44) has no bridge chip to reach. The telemetry
# task installs the USB Serial/JTAG driver and routes console output through it,
# which keeps log lines from ever landing inside a telemetry frame.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# VL53L8CX: only distance and target status are used downstream. Switching the
# other outputs off shrinks both the I2C readout and the results struct, which
# matters with two sensors sharing one bus at 15 Hz.
CONFIG_VL53L8CX_NB_TARGET_PER_ZONE=1
CONFIG_VL53L8CX_DISABLE_AMBIENT_PER_SPAD=y
CONFIG_VL53L8CX_DISABLE_NB_SPADS_ENABLED=y
CONFIG_VL53L8CX_DISABLE_NB_TARGET_DETECTED=y
CONFIG_VL53L8CX_DISABLE_SIGNAL_PER_SPAD=y
CONFIG_VL53L8CX_DISABLE_RANGE_SIGMA_MM=y
CONFIG_VL53L8CX_DISABLE_REFLECTANCE_PERCENT=y
CONFIG_VL53L8CX_DISABLE_MOTION_INDICATOR=y
